# Data cleaning in python 
## Data might come from various sources 
## might contain null values, NaN, empty spaces 
## these need to be cleanned before further analysis can be done

In [1]:
# setup environment 
import numpy as np 
import pandas as pd
print("Setup completed")

Setup completed

In [2]:
#sample dataframe 

df = pd.DataFrame({
    'Column A': [1,np.nan,20, np.nan],
    'Column B': [2,4,8, np.nan],
    'Column C': [np.nan,9,32,np.nan],
    'Column D': [5,7,25, 50],
})

In [3]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       4.0       9.0         7
2      20.0       8.0      32.0        25
3       NaN       NaN       NaN        50

In [4]:
#check existence of null values 
df.isnull()

   Column A  Column B  Column C  Column D
0     False     False      True     False
1      True     False     False     False
2     False     False     False     False
3      True      True      True     False

In [5]:
#returns true or false per null values

In [6]:
# see an overview of null values 
df.isnull().sum()

Column A    2
Column B    1
Column C    2
Column D    0
dtype: int64

In [7]:
# Handling null values 
# dropna()
# this will drop any row in which a null value is found
# this might not be what we want

In [8]:
df.dropna()

   Column A  Column B  Column C  Column D
2      20.0       8.0      32.0        25

In [9]:
# deleted all rows except row 2

In [13]:
df.shape # 4 entries

(4, 4)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Column A  2 non-null      float64
 1   Column B  3 non-null      float64
 2   Column C  2 non-null      float64
 3   Column D  4 non-null      int64
dtypes: float64(3), int64(1)
memory usage: 256.0 bytes

In [ ]:
# dropna(parameters)
# axis='columns'

In [14]:
df.dropna(axis=1) # this will check columns that have null values and drop them

   Column D
0         5
1         7
2        25
3        50

In [15]:
# create a new dataframe

df2 = pd.DataFrame({
    'Column A': [1,np.nan,20],
    'Column B': [2,np.nan,30],
    'Column C': [np.nan,np.nan,40],
})

In [16]:
df2

   Column A  Column B  Column C
0       1.0       2.0       NaN
1       NaN       NaN       NaN
2      20.0      30.0      40.0

In [17]:
#dropna(parameter)
# how='any' or 'all'
# thresh = number of na values to ignore

In [19]:
df.dropna(how='all')

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       4.0       9.0         7
2      20.0       8.0      32.0        25
3       NaN       NaN       NaN        50

In [20]:
df.dropna(how='any') #default

   Column A  Column B  Column C  Column D
2      20.0       8.0      32.0        25

In [21]:
df.dropna(thresh=3) #rows with 3 or more NaN will be dropped

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       4.0       9.0         7
2      20.0       8.0      32.0        25

In [23]:
# for the columns 
df.dropna(thresh=3, axis=1) # checks columns using the threshold value

   Column B  Column D
0       2.0         5
1       4.0         7
2       8.0        25
3       NaN        50

## Finding Null Values 
### Sometimes you do not want to drop the null values instead you want to replace them with other values 
This is dependent on the dataset you're working with. 
some options are:
- replacing nan with 0. 
- the sample mean
- the closest value

In [28]:
s = pd.Series([1,2,3,np.nan,np.nan,4])

In [29]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [30]:
s.fillna(0)

0    1.0
1    2.0
2    3.0
3    0.0
4    0.0
5    4.0
dtype: float64

In [31]:
s.fillna(s.mean())

0    1.0
1    2.0
2    3.0
3    2.5
4    2.5
5    4.0
dtype: float64

In [32]:
## filling nulls with contiguous values (close)
## using a method, foward fill 'ffill' or backward fill 'bfill'
## if there are nan's at the beginning of a row or column they may not be caught with the 'ffill'

In [33]:
s.fillna(method='ffill')

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    4.0
dtype: float64

In [34]:
s.fillna(method='bfill')

0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    4.0
dtype: float64

In [40]:
# nan at the begining
s1 = s.copy()

In [42]:
s1[0] = np.nan

In [43]:
s1

0    NaN
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [44]:
s1.fillna(method='ffill') # does'nt catch the first NaN

0    NaN
1    2.0
2    3.0
3    3.0
4    3.0
5    4.0
dtype: float64

# Filling null values on DataFrames

In [35]:
# mix and match 
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       4.0       9.0         7
2      20.0       8.0      32.0        25
3       NaN       NaN       NaN        50

In [36]:
df.fillna({'Column A':0,'Column B':99,'Column C':df['Column C'].mean()})

   Column A  Column B  Column C  Column D
0       1.0       2.0      20.5         5
1       0.0       4.0       9.0         7
2      20.0       8.0      32.0        25
3       0.0      99.0      20.5        50

In [37]:
# method and axis 
df.fillna(method='ffill', axis=0) #axis = 0 will fill in the vertical direction

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       1.0       4.0       9.0         7
2      20.0       8.0      32.0        25
3      20.0       8.0      32.0        50

In [39]:
df.fillna(method='ffill', axis=1) #axis = 1 will fill in the horizontal direction

   Column A  Column B  Column C  Column D
0       1.0       2.0       2.0       5.0
1       NaN       4.0       9.0       7.0
2      20.0       8.0      32.0      25.0
3       NaN       NaN       NaN      50.0